"-------------------------------------------------------------------------------
" seach
"-------------------------------------------------------------------------------
set ignorecase                     "小文字の検索でも大文字も見つかるようにする
set smartcase                      "ただし大文字も含めた検索の場合はその通りに検索する
set incsearch                      "インクリメンタルサーチを行う
set nowrapscan                     "(no)検索をファイルの末尾まで検索したら、ファイルの先頭へループする
set hlsearch                       "highlight matches with last search pattern
set wrapscan                       "最後まで検索したら先頭に戻る
